{
    "FunFactsAboutCambodia": [
        {
            "Festival": "Khmer New Year",
            "Dates": "April 13th-16th, 2024",
            "Description": "Khmer New Year, or Chol Chnam Thmey, is the most significant celebration in Cambodia, marking the end of the harvest season. Held in mid-April, it is a time of joy, feasting, and honoring ancestors. Key traditions include making offerings to ancestors, preparing and sharing special dishes like 'kralan,' and engaging in traditional games such as Chol Chhoung and Leak Kanseng. The festival, deeply rooted in Cambodian culture, also involves dressing in traditional garments, especially for temple visits. It embodies a blend of spirituality and community, symbolizing a fresh start and the washing away of the past year's misdeeds through specific rituals like cleansing Buddha statues and elders with perfumed water."
        },
        {
            "Festival": "Pchum Ben",
            "Dates": "Oct 1-3, 2024",
            "Description": "Pchum Ben, also known as Ancestors' Day, is a unique 15-day Buddhist festival in Cambodia, culminating in the last three days, which are public holidays. It's a time when Cambodians honor their ancestors up to seven generations back. The festival involves offering food to Buddhist monks to earn merit that benefits the deceased, with specific practices like throwing rice-balls or food into empty fields to 'feed' the spirits believed to be more active during this period. The festival reflects deep respect for ancestors and the importance of family and community ties."
        },
        {
            "Festival": "Bon Om Touk",
            "Dates": "Nov 14th-16th, 2024",
            "Description": "Bon Om Touk, the Cambodian Water Festival, marks the end of the rainy season with boat races, illuminated boat processions, and cultural performances in Phnom Penh and other parts of Cambodia. It celebrates the reversal of the flow of the Tonle Sap River and pays homage to the water's significance in Cambodian life. The festival includes three days of racing by dragon boats from various communities, symbolizing historical and mythological themes, including military victories and spiritual legends. Each evening, the festival is capped off with spectacular fireworks and illuminated boats, making it a major event that draws crowds from across the nation."
        }
    ]
}